# Loading packages and importing data sets.

In [1]:
import pandas as pd
import numpy as np

In [2]:
# Source data downloaded from is Yahoo Finance.
kroger = pd.read_csv('/Users/granthakason/Downloads/KR.csv')
target = pd.read_csv('/Users/granthakason/Downloads/TGT.csv')
walmart = pd.read_csv('/Users/granthakason/Downloads/WMT.csv')

# Adding company field into each data set

### Kroger

In [75]:
kroger['company'] = kroger['company'].fillna(0, inplace=True)
kroger['company'] = kroger['company'].apply(lambda x: 'Kroger' if x is None else x)
kroger.head(3)

,Date,Open,High,Low,Close,Adj Close,Volume,company
0,2022-03-21,55.980000,57.610001,55.619999,55.680000,54.536987,6458600,Kroger
1,2022-03-22,56.000000,56.799999,55.130001,56.570000,55.408714,7006000,Kroger
2,2022-03-23,56.740002,57.200001,56.169998,56.450001,55.291183,5209300,Kroger

### Target

In [74]:
target['company'] = target['company'].fillna(0, inplace=True)
target['company'] = target['company'].apply(lambda x: 'Target' if x is None else x)
target.head(3)

,Date,Open,High,Low,Close,Adj Close,Volume,company
0,2022-03-21,226.029999,228.460007,221.320007,223.000000,217.958893,3023500,Target
1,2022-03-22,223.710007,224.630005,221.750000,222.770004,217.734100,2464000,Target
2,2022-03-23,222.270004,222.729996,215.940002,216.720001,211.820877,2993500,Target

### Walmart

In [73]:
walmart['company'] = walmart['company'].fillna(0, inplace=True)
walmart['company'] = walmart['company'].apply(lambda x: 'Walmart' if x is None else x)
target.head(3)

,Date,Open,High,Low,Close,Adj Close,Volume,company
0,2022-03-21,226.029999,228.460007,221.320007,223.000000,217.958893,3023500,Target
1,2022-03-22,223.710007,224.630005,221.750000,222.770004,217.734100,2464000,Target
2,2022-03-23,222.270004,222.729996,215.940002,216.720001,211.820877,2993500,Target

# Making them a single data set and making company the first field in the data set.

In [69]:
retail_stk_data = pd.concat([kroger, target, walmart])

In [70]:
retail_stk_data.insert(0, 'company', retail_stk_data.pop('company'))

In [71]:
retail_stk_data['company'].value_counts()

Kroger     250
Target     250
Walmart    250
Name: company, dtype: int64

In [76]:
retail_stk_data.head(3)

,company,Date,Open,High,Low,Close,Adj Close,Volume
0,Kroger,2022-03-21,55.980000,57.610001,55.619999,55.680000,54.536987,6458600
1,Kroger,2022-03-22,56.000000,56.799999,55.130001,56.570000,55.408714,7006000
2,Kroger,2022-03-23,56.740002,57.200001,56.169998,56.450001,55.291183,5209300

# Export retail_stk_data as csv

In [77]:
retail_stk_data.to_csv('retail_stk_data.csv', index=False)